_orgs/_posts/_site/linux/2015-11-06-using-vim.org
#+TITLE:     Vim 使用笔记
#+AUTHOR:    赵仁贵
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs2.swfc.edu.cn/org-info-js/org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+BEGIN_EXPORT HTML
---
layout: post
title: Vim 使用笔记
author: zrg
comments: false
description: Vim是一个类似于Vi的著名的功能强大、高度可定制的文本编辑器，在Vi的基础上改进和增加了很多特性。
categories: 
- software
tags:
- VIM
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* Vim 快捷键
  #+CAPTION: Vim Keyboard
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | 命令                  | 描述                                                                                                                                      |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | :set nu!              | 显示行号                                                                                                                                  |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | syntax on             | 语法高亮度显示                                                                                                                            |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | :set ai!              | 设置自动缩进                                                                                                                              |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | :100                  | 跳到指定行:/word搜索                                                                                                                      |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | :split                | 分割视窗(可加名称随便开启另一档案)                                                                                                        |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | n/N                   | 继续搜索下一处/上一处关键词                                                                                                               |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | u                     | 撤销                                                                                                                                      |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | Ctrl+r                | 恢复                                                                                                                                      |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | gg=G                  | Formart格式化                                                                                                                             |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | y                     | 复制（v模式下）                                                                                                                           |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | p                     | 粘贴                                                                                                                                      |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | 顺斜杠:/              | 查找(normal模式下)                                                                                                                        |
  |                       | 按下n查找下一个，按下N查找上一个。                                                                                                        |
  |                       | Vim查找支持正则表达式，例如/vim$匹配行尾的"vim"。 需要查找特殊字符需要转义，例如/vim\$匹配"vim$"。                                        |
  |                       | 注意：查找回车应当用\n，而替换为回车应当用\r（相当于<CR>）。                                                                              |
  |                       | \c表示大小写不敏感查找，\C表示大小写敏感查找。                                                                                            |
  |                       | *即可查找光标所在单词（word）， 要求每次出现的前后为空白字符或标点符号。例如当前为foo， 可以匹配foo bar中的foo，但不可匹配foobar中的foo。 |
  |                       | g*即可查找光标所在单词的字符序列，每次出现前后字符无要求。 即foo bar和foobar中的foo均可被匹配到。                                         |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
  | :s（substitute）      | 查找和替换。语法如下：                                                                                                                    |
  |                       | :{作用范围}s/{目标}/{替换}/{替换标志}                                                                                                     |
  |                       | 例如:%s/foo/bar/g会在全局范围(%)查找foo并替换为bar，所有出现都会被替换（g）。                                                             |
  |                       | 1. 作用范围分为当前行、全文、选区等等。                                                                                                   |
  |                       | 	当前行：:s/foo/bar/g。                                                                                                            |
  |                       | 	全文：:%s/foo/bar/g。                                                                                                             |
  |                       | 	选区，在Visual模式下选择区域后输入:，Vim即可自动补全为 :'<,'>：:'<,'>s/foo/bar/g。                                                |
  |                       | 	2-11行：:5,12s/foo/bar/g                                                                                                          |
  |                       | 	当前行.与接下来两行+2：:.,+2s/foo/bar/g                                                                                           |
  |                       | 2. 替换标志                                                                                                                               |
  |                       | 	空替换标志表示只替换从光标位置开始，目标的第一次出现：:%s/foo/bar                                                                 |
  |                       | 	i表示大小写不敏感查找，I表示大小写敏感：                                                                                          |
  |                       | 		:%s/foo/bar/i                                                                                                             |
  |                       | 		# 等效于模式中的\c（不敏感）或\C（敏感）                                                                                  |
  |                       | 		:%s/foo\c/bar                                                                                                             |
  |                       | 	c表示需要确认，例如全局查找"foo"替换为"bar"并且需要确认：:%s/foo/bar/gc                                                           |
  |-----------------------+-------------------------------------------------------------------------------------------------------------------------------------------|
* 高亮设置
** 高亮颜色设置
: 可以在 ~/.vimrc 中进行设置：
#+NAME:.vimrc
#+BEGIN_SRC emacs-lisp
highlight Search ctermbg=yellow ctermfg=black 
highlight IncSearch ctermbg=black ctermfg=yellow 
highlight MatchParen cterm=underline ctermbg=NONE ctermfg=NONE
#+END_SRC
: 上述配置指定 Search 结果的前景色（foreground）为黑色，背景色（background）为灰色； 渐进搜索的前景色为黑色，背景色为黄色；光标处的字符加下划线。
** 禁用/启用高亮
: // 禁用所有高亮
: :nohighlight 或 :nohl

: //只禁用搜索高亮
: :set nohlsearch
: //下次搜索时，需再次启动搜索高亮
: :set hlsearch
+ 延时禁用
  : 让Vim查找/替换后一段时间自动取消高亮，发生查找时自动开启呢？
  #+NAME:延时禁用
  #+BEGIN_SRC emacs-lisp -n 1
  " 当光标一段时间保持不动了，就禁用高亮
  autocmd cursorhold * set nohlsearch
  " 当输入查找命令时，再启用高亮
  noremap n :set hlsearch<cr>n
  noremap N :set hlsearch<cr>N
  noremap / :set hlsearch<cr>/
  noremap ? :set hlsearch<cr>?
  noremap * *:set hlsearch<cr>
  #+END_SRC
+ 一键禁用
  : 设置快捷键来一键禁用/开启搜索高亮：
  #+NAME:一键禁用
  #+BEGIN_SRC emacs-lisp
  nnoremap <c-h> :call DisableHighlight()<cr>
  function! DisableHighlight()
  	set nohlsearch
  endfunc
  #+END_SRC
  : 希望关闭高亮时只需要按下 Ctrl+H，当发生下次搜索时又会自动启用。
+ 设置生效
  : Notice: 设置完成后，发现功能没有起作用，检查一下系统下是否安装了vim-enhanced包，查询命令为： 
  : $ rpm -q vim-enhanced
* References
+ [[https://harttle.land/2016/08/08/vim-search-in-file.html][在 Vim 中优雅地查找和替换]]
